cfg/Catalogs/СпособыОтраженияЗарплатыВРеглУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СпособыОтраженияЗарплатыВРеглУчете</Name>
			<Comment>(Регл)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоДт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоКт3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзносыОсновногоНачисления</Name>
					<Comment>Особый способ отражения для ЕСВ ФОТ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВзносы</Name>
					<Comment>Есть проводка по взносам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСчетДтВзносы</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСубконтоДтВзносы1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСубконтоДтВзносы2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСубконтоДтВзносы3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяВаловыхРасходовВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеДоНКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяВаловыхРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначениеНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияЕСВФОТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/СпособыОтраженияЗарплатыВРеглУчете/Forms/ФормаВыбора/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ СправочникСписок

Процедура СправочникСписокПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если НЕ ДанныеСтроки.ЭтоГруппа Тогда
		ЧислоСубконтоДт = ДанныеСтроки.СчетДт.ВидыСубконто.Количество();
		ЧислоСубконтоКт = ДанныеСтроки.СчетКт.ВидыСубконто.Количество();
		ОформлениеСтроки.Ячейки.СубконтоДт1.ТолькоПросмотр = ЧислоСубконтоДт = 0;
		ОформлениеСтроки.Ячейки.СубконтоДт2.Видимость = ЧислоСубконтоДт > 1;
		ОформлениеСтроки.Ячейки.СубконтоДт3.Видимость = ЧислоСубконтоДт > 2;
		ОформлениеСтроки.Ячейки.СубконтоКт1.ТолькоПросмотр = ЧислоСубконтоКт = 0;
		ОформлениеСтроки.Ячейки.СубконтоКт2.Видимость = ЧислоСубконтоКт > 1;
		ОформлениеСтроки.Ячейки.СубконтоКт3.Видимость = ЧислоСубконтоКт > 2;
		
		СчетДебета = ДанныеСтроки.СчетДт;
	КонецЕсли;
	НастройкаВидимостиНалоговыхНазначенийПоЗатратам(Элемент, ОформлениеСтроки, ДанныеСтроки);
КонецПроцедуры

Процедура СправочникСписокСчетДтПриИзменении(Элемент)
	
    ЧислоСубконто = Элемент.Значение.ВидыСубконто.Количество();
	Если ЧислоСубконто > 0 Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоДт1 = Элемент.Значение.ВидыСубконто[0].ВидСубконто.ТипЗначения.ПривестиЗначение(ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоДт1);
	КонецЕсли;
	Если ЧислоСубконто > 1 Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоДт2 = Элемент.Значение.ВидыСубконто[1].ВидСубконто.ТипЗначения.ПривестиЗначение(ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоДт2);
	КонецЕсли;
	Если ЧислоСубконто > 2 Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоДт3 = Элемент.Значение.ВидыСубконто[2].ВидСубконто.ТипЗначения.ПривестиЗначение(ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоДт3);
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникСписокСчетКтПриИзменении(Элемент)
    ЧислоСубконто = Элемент.Значение.ВидыСубконто.Количество();
	Если ЧислоСубконто > 0 Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоКт1 = Элемент.Значение.ВидыСубконто[0].ВидСубконто.ТипЗначения.ПривестиЗначение(ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоКт1);
	КонецЕсли;
	Если ЧислоСубконто > 1 Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоКт2 = Элемент.Значение.ВидыСубконто[1].ВидСубконто.ТипЗначения.ПривестиЗначение(ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоКт2);
	КонецЕсли;
	Если ЧислоСубконто > 2 Тогда
		ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоКт3 = Элемент.Значение.ВидыСубконто[2].ВидСубконто.ТипЗначения.ПривестиЗначение(ЭлементыФормы.СправочникСписок.ТекущиеДанные.СубконтоКт3);
	КонецЕсли;
КонецПроцедуры

Процедура НастройкаВидимостиНалоговыхНазначенийПоЗатратам(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт1) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт1) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт1.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;
	Если ТипЗнч(ДанныеСтроки.СубконтоДт2) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт2) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт2.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт3) = Тип("СправочникСсылка.НоменклатурныеГруппы")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт3) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт3.НалоговоеНазначениеВПроизводстве;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт1) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт1) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт1.НалоговоеНазначение;
	КонецЕсли;
	Если ТипЗнч(ДанныеСтроки.СубконтоДт2) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт2) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт2.НалоговоеНазначение;
	КонецЕсли;	
	Если ТипЗнч(ДанныеСтроки.СубконтоДт3) = Тип("СправочникСсылка.ОбъектыСтроительства")
		И ЗначениеЗаполнено(ДанныеСтроки.СубконтоДт3) Тогда
		ОформлениеСтроки.Ячейки.НалоговоеНазначениеНДС.Текст = ДанныеСтроки.СубконтоДт3.НалоговоеНазначение;
	КонецЕсли;

КонецПроцедуры
